app/views/car_orders/index.html.erb

        <td><%= car_order.customer %></td>
        <td><%= car_order.orderDate %></td>
---
SELECT "car_orders".* FROM "car_orders"