app/controllers/car_orders_controller.rb

  def index
    @car_orders = CarOrder.all
---
SELECT "car_orders".* FROM "car_orders"

  def create
    @car_order = CarOrder.new(car_order_params)

    respond_to do |format|
      if @car_order.save
---
INSERT INTO "car_orders" ("customer", "orderDate", "deliveryDate", "adet", "fiyat", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["customer", ""], ["orderDate", Tue, 05 Jun 2018], ["deliveryDate", Tue, 05 Jun 2018], ["adet", ""], ["fiyat", ""], ["created_at", 2018-06-05 03:53:51 UTC], ["updated_at", 2018-06-05 03:53:51 UTC]]

  def update
    respond_to do |format|
      if @car_order.update(car_order_params)
---
UPDATE "car_orders" SET "customer" = $1, "status" = $2, "cname" = $3, "pname" = $4, "updated_at" = $5 WHERE "car_orders"."id" = $6  [["customer", ""], ["status", "Pending"], ["cname", ""], ["pname", ""], ["updated_at", 2018-06-05 05:49:04 UTC], ["id", 4]]

    def set_car_order
      @car_order = CarOrder.find(params[:id])
---
SELECT  "car_orders".* FROM "car_orders" WHERE "car_orders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]