app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("name", "fuel", "series", "state", "created_at", "updated_at", "desc", "price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", ""], ["fuel", ""], ["series", ""], ["state", false], ["created_at", 2018-06-05 05:26:02 UTC], ["updated_at", 2018-06-05 05:26:02 UTC], ["desc", ""], ["price", "2.900.00"]]

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "name" = $1, "year" = $2, "fuel" = $3, "series" = $4, "state" = $5, "updated_at" = $6 WHERE "cars"."id" = $7  [["name", "Micra"], ["year", 1993], ["fuel", "Benzin"], ["series", "1.3 GX "], ["state", false], ["updated_at", 2018-06-04 06:17:00 UTC], ["id", 3]]

  def destroy
    @car.destroy
---
DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 1]]