app/controllers/parts_controller.rb

  def index
    @parts = Part.all
---
SELECT "parts".* FROM "parts"

  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save
---
INSERT INTO "parts" ("desc", "name", "price", "part_no", "created_at", "updated_at", "car_id", "category") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["desc", ""], ["name", ""], ["price", ""], ["part_no", ""], ["created_at", 2018-06-05 05:26:10 UTC], ["updated_at", 2018-06-05 05:26:10 UTC], ["car_id", 1], ["category", ""]]

  def update
    respond_to do |format|
      if @part.update(part_params)
---
UPDATE "parts" SET "desc" = $1, "name" = $2, "price" = $3, "part_no" = $4, "updated_at" = $5 WHERE "parts"."id" = $6  [["desc", "Uyumlu Olduğu Model:1993>1997"], ["name", "MICRA ÖN FAR SOL"], ["price", "90"], ["part_no", "57617"], ["updated_at", 2018-06-04 08:50:53 UTC], ["id", 1]]

  def destroy
    @part.destroy
---
DELETE FROM "parts" WHERE "parts"."id" = $1  [["id", 1]]

    def set_part
      @part = Part.find(params[:id])
---
SELECT  "parts".* FROM "parts" WHERE "parts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]